doc/lectures/lecture_encapsulation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Encapsulation des données</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="lecture_pointeur.html">Pointeurs, références & allocation dynamique </a><a href="lecture_fonction.html">Rappels sur les fonctions </a><a href="lecture_specificite_c++.html">Les spécificités du C++ </a><a href="lecture_struct_class.html">Structures et classes </a><a href="lecture_encapsulation.html">Encapsulation des données </a><a href="lecture_constructeur.html">Notions de constructeur et de destructeur </a><a href="lecture_amitie.html">Fonctions et classes amies </a><a href="lecture_surcharge.html">Surcharge d'opérateur </a><a href="lecture_heritage.html">Héritage </a><a href="lecture_template.html">Notions de patrons de fonctions et de classes </a><a href="lecture_librairie_standard.html">Introduction à la librairie standard STL </a><a href=""></a><hr/><a href="annexe_compilation.html">Compilation et directives de préprocesseur </a><a href="annexe_convention_ecriture.html">Convention d'écriture et organisation des programmes </a><a href="annexe_cout_cin.html">Écriture/lecture sur l'entrée/sortie standard </a><a href="annexe_variable_statique.html">Les membres données statiques </a><a href="annexe_enum_typedef.html">Utilisation de enum et de typedef </a>
                    <hr/>
                    <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Encapsulation des données</h1><hr/>
<p>
L&rsquo;encapsulation, littéralement la mise sous capsule, consiste à interdire
l&rsquo;accès de certains membres d&rsquo;une classe à toutes fonctions extérieures à la
classe. En d&rsquo;autres termes, il n&rsquo;est pas possible d&rsquo;agir <b>directement</b> sur les
données d&rsquo;un objet, toutes modifications des membres de l&rsquo;objet se faisant par
<b>l&rsquo;intermédiaire</b> des méthodes associées.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Intérêt de l&rsquo;encapsulation</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Avantages</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Lors de la programmation et surtout de la réutilisation d&rsquo;un objet dans un
autre programme, l&rsquo;encapsulation empêche la modification non voulu des données
membres,
</li>

<li>L&rsquo;objet, vu de l&rsquo;extérieur, n&rsquo;est caractérisé que par ses méthodes. La manière
dont elles fonctionnent (<i>i.e.</i> les rouages à l&rsquo;intérieur de l&rsquo;objet) n&rsquo;a
pas d&rsquo;importance. Ainsi :

<ol class="org-ol">
<li>l&rsquo;objet est plus facile à utiliser pour quelqu&rsquo;un d&rsquo;extérieur, il lui
suffit d&rsquo;utiliser les méthodes.
</li>

<li>la maintenance et l&rsquo;amélioration de l&rsquo;objet est grandement facilitée. Tant
que la finalité des méthodes ne change pas, on peut modifier les rouages
sans perturber pour autant les utilisateurs de la classe.
</li>

<li>l&rsquo;objet est facilement réutilisable.
</li>
</ol>
</li>
</ul>

<p>
Vu de &ldquo;l&rsquo;extérieur&rdquo;, un objet se caractérise par les spécifications (noms,
arguments et rôles) de ses méthodes, la manière dont sont réellement implantées
les données étant finalement sans importance<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Inconvénients</h3>
<div class="outline-text-3" id="text-1-2">
<p>
De prime abord, peut paraître inutile et lourd à utiliser
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Syntaxe</h2>
<div class="outline-text-2" id="text-2">
<p>
Les mots clés sont <code>private</code> et <code>public</code> <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">point</span>
{
<span class="org-keyword">private</span> :
  <span class="org-type">int</span> <span class="org-variable-name">m_X</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">x et y sont alors priv&#233;s</span>
  <span class="org-type">int</span> <span class="org-variable-name">m_Y</span>;

<span class="org-keyword">public</span> :
  <span class="org-type">void</span> <span class="org-function-name">affiche</span>();
  <span class="org-type">void</span> <span class="org-function-name">initialise</span>(<span class="org-type">int</span> <span class="org-variable-name">abs</span>, <span class="org-type">int</span> <span class="org-variable-name">ord</span>);
  <span class="org-type">int</span> <span class="org-function-name">get_x</span>() { <span class="org-keyword">return</span> m_X; }
  <span class="org-type">int</span> <span class="org-function-name">get_y</span>() { <span class="org-keyword">return</span> m_Y; }
};
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Utilisation</h2>
<div class="outline-text-2" id="text-3">
<p>
Tout objet bien conçu doit encapsuler ses membres. En pratique cela nécessite :
</p>

<ul class="org-ul">
<li>des méthodes <b>pour accéder</b> aux valeurs des membres encapsulés (dans l&rsquo;exemple
précédent, il s&rsquo;agit de <code>get_x()</code> et <code>get_y()</code>),
</li>

<li>des méthodes <b>pour modifier</b> les membres (la méthode <code>initialise(int,int)</code>
  permet une telle modification).
</li>
</ul>
<p>
Dans l&rsquo;exemple précédent, pour accéder au membre <code>m_X</code> on écrira
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">point</span> <span class="org-variable-name">my_point</span>;
cout &lt;&lt; my_point.get_x() &lt;&lt; endl;
</pre>
</div>
<p>
et non
</p>
<div class="org-src-container">

<pre class="src src-c++">cout &lt;&lt; my_point.m_X &lt;&lt; endl;
</pre>
</div>
<p>
qui sera, quoiqu&rsquo;il arrive, rejeté par le compilateur en raison de
l&rsquo;encapsulation de <code>m_X</code>.
</p>

<p>
Par défaut, les données <i>i.e.</i> les membres d&rsquo;une classe sont privées à l&rsquo;inverse
d&rsquo;une structure où les données sont par défaut publiques. Par conséquent, le mot
clé <code>private</code> n&rsquo;est pas nécessaire dans la déclaration de la classe <code>Point</code>.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes"> </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
une telle notion est communément appelée &ldquo;abstraction des données&rdquo;
exprimant le fait que les détails de l&rsquo;implémentation demeurent cachés
</p></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
ainsi que <code>protected</code> qui est intermédiaire et qui s&rsquo;utilise pour les
classes dérivées.
</p></div>


</div>
</div></div>
</body>
</html>
